ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/FSIRX3_CFG.xml
	<register id="CFG_RX_ECC_DATA" acronym="CFG_RX_ECC_DATA" offset="0x40" width="32" description="Receive ECC data register">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC DataWriting to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC DataWriting to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_ECC_VAL" acronym="CFG_RX_ECC_VAL" offset="0x44" width="16" description="Receive ECC value register">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x0" description="ECC Value for SEC-DED checkThis field contains the ECC value to be used for SEC-DED either for 16-bit or 32-bit data in the RX_ECC_DATA register." range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_8" acronym="CFG_Reserved_8" offset="0x46" width="16" description="">
		
	</register>
	<register id="CFG_RX_ECC_SEC_DATA" acronym="CFG_RX_ECC_SEC_DATA" offset="0x48" width="32" description="Receive ECC corrected data register">
		<bitfield id="SEC_DATA" width="32" begin="31" end="0" resetval="0x0" description="ECC Single Error Corrected DataThe ECC corrected data will be available in this register. This value is valid only when there are no bit errors, or a single bit error was detected. Otherwise, the contents of this register are invalid and should not be used." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_ECC_LOG" acronym="CFG_RX_ECC_LOG" offset="0x4C" width="16" description="Receive ECC log and status register">
		<bitfield id="MBE" width="1" begin="1" end="1" resetval="0x1" description="Multiple Bit Errors DetectedThis bit indicates the occurrence of multiple bit errors.The data is corrupted and cannot be corrected. If this bit is set, the data present in RX_ECC_SEC_DATA is invalid and should not be used. 0h [R] Multiple Bit Errors were not detected. Check the SBE bit for single bit errors.1h [R] Multiple Bit Errors were detected. The data is not able to be corrected. The value present in RX_ECC_SEC_DATA is invalid and should not be used." range="1" rwaccess="R"/> 
		<bitfield id="SBE" width="1" begin="0" end="0" resetval="0x1" description="Single Bit Error DetectedThis bit indicates the occurrence of a single bit error in the data. The data is autocorrected and placed into the RX_ECC_SEC_DATA register. This bit is valid only if MBE is 0. 0h [R] No bit errors were detected. The value in RX_ECC_SEC_DATA is correct. 1h [R] A single bit error was detected and corrected. The corrected data is present in RX_ECC_SEC_DATA." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_Reserved_9" acronym="CFG_Reserved_9" offset="0x4E" width="16" description="">
		
	</register>
	<register id="CFG_RX_FRAME_TAG_CMP" acronym="CFG_RX_FRAME_TAG_CMP" offset="0x50" width="16" description="Receive frame tag compare register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bitThis will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the frame tag match event will be triggered as normal This bit only takes effect only if CMP_EN is set to 1. 0h [R/W] Broadcast frame match disabled.1h [R/W] Broadcast frame match enabled." range="9" rwaccess="R/W"/> 
		<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Frame Tag Compare Enable bitSet this bit to enable the comparison of an incoming frame  tag and the value stored in the frame tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming frame tag will trigger the apprpriate frame tag match event. 0h [R/W] Frame tag comparison is disabled.1h [R/W] Frame tag comparison is enabled." range="8" rwaccess="R/W"/> 
		<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Frame Tag MaskAny bit position in this register set to 0 will be used in the comparison of the incoming frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison. This mask value is used only for non-ping frames. " range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Frame Tag ReferenceThe reference tag to check against when comparing the TAG_MASK and the incoming frame tag. This reference value is used only for non-ping frames." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_PING_TAG_CMP" acronym="CFG_RX_PING_TAG_CMP" offset="0x52" width="16" description="Receive ping tag compare register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bitThis will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the ping tag match event will be triggered as normal This bit only takes effect only if CMP_EN is set to 1. 0h [R/W] Broadcast frame match disabled.1h [R/W] Broadcast frame match enabled." range="9" rwaccess="R/W"/> 
		<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Ping Tag Compare Enable bitSet this bit to enable the comparison of an incoming ping tag and the value stored in the ping tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming ping tag will trigger a ping frame tag match event. 0h [R/W] Ping tag comparison is disabled.1h [R/W] Ping tag comparison is enabled." range="8" rwaccess="R/W"/> 
		<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Ping Tag MaskAny bit position in this register set to 0 will be used in the comparison of the incoming ping frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison. This mask value is used only for ping frames. " range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Ping Tag ReferenceThe reference tag to check against when comparing the TAG_MASK and the incoming ping tag. This reference value is used only for ping frames." range="3 - 0" rwaccess="R/W"/>
	</register>
